Description: Downloads the latest version of PeaZip. (arm and intel).
Identifier: com.github.d33t5.download.PeaZip-Universal
MinimumVersion: '2.3'

Input:
  NAME: PeaZip

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: '.*aarch64\.dmg$'
      github_repo: 'peazip/PeaZip'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: '.*x86_64\.dmg$'
      github_repo: 'peazip/PeaZip'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-x86_64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'

  - Processor: EndOfCheckPhase

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-x86_64.dmg'
      